{
    "english":
    {
        "name":"NGUYEN TRI HIEU",
        "name_vn": "NGUYỄN TRÍ HIẾU",
        "item":[
            "Home", 
            "Profile", 
            "Education",
            "Skills",
            "Experience",
            "Languages",
            "Personal Project and Courses",
            "Social"
        ],
        "title":"Software Enginneer",
        "address": "HCMC",
        "email": "trihieu08101999@gmail.com",
        "phone": "0706987057",
        "note": "Visit my responsive profile for a better experience",
        "profile": "A software engineer with two years of experience in developing, deploying, maintaining, and securing the web application. Strong background in networking and machine learning, hands-on experience in web application backend and system engineering, and interest in cybersecurity. ",
        "education": {
            "degree": "Bachelor degree of Electronics and Telecommunications",
            "studies": "Hochiminh city university of technology (BKU)",
            "year": "2017-2021"
        },
        "experience": {
            "tma": {
                "title": "Software Enginneer",
                "time": "From 2-2021 to 4-2022 | TMA Solutions",
                "detail": [
                    "- Developing and maintaining a web application. Provide a patch for the application every 2 months, and create a new version for this one. (VoIP platforms)",
                    "- Build LDAP client, LDAP testing server and a Shell script for installation automatically"
                ],
                "tech": "Technologies: Java, Bash, Spring framework, RHEL, CentOS, Burp Suite, MySQL, LDAP, Tomcat, VMware VCloud, ..."
            },
            "vts":{
                "title": "Software Enginneer",
                "time": "From 4-2022 to present | Viettel Solutions", 
                "detail": [
                    "- Collaborate with infrastructure team, network team, cybersecurity team, backend team, NOC to managing servers, connections, security, ensure service's availability, service’s performance.",
                    "- Manage, maintain, install and deploy DMS applications in SIT, UAT, POC and Production environment",
                    "- Building DevSecOps pipeline for Production environment",
                    "- Research, design, and implement solutions for containerization, performance enhancements and monitoring.",
                    "- Penetration testing for various web application projects. (SAST, DAST and manual test). Main responsibility for information security for VTS Southern branch (VPN, Personal Computer, standards, regulations, ...)",
                    "- Develop a backend API using Spring Boot, gRPC and MongoDB."
                ],
                "tech": "Technologies: Java, Spring Boot, Oracle Database, MongoDB, PostgreSQL, gRPC, SocketIO, Burp Suite, Kali Linux, CentOS, Tomcat, ISO security standard, Jenkins, Docker, Ansible, ..."
            }
        },
        "project":[
            "Course: AWS Cloud Practitioner Essentials",
            "PortSwigger vulnerability labs",
            "Graduation thesis: Signal demodulation with Machine learning in OLED Visible Light Communication [1 year research in laboratory - 2021] [Python, PNN, GRNN, DTNN]",
            "Kanji recognition [2022] [Python, Tkinter, Pyautogui, OpenCV, Sklearn]",
            "Exam Marking - Hand writing recognition [2020] [Python, OpenCV, Tkinter]",
            "Alcohol recognition based on light spectrum [2019] [Python, Tensorflow]",
            "Responsive resume [2022] [HTML, CSS, Javascript]"
        ],
        "language": ["Vietnames", "English", "Japanese"],
        "interest": ["Football", "Anime", "Cooking", "Reading"]
    },
    "vietnamese":
    {
        "name":"NGUYEN TRI HIEU",
        "name_vn": "NGUYỄN TRÍ HIẾU",
        "item":[
            "Home", 
            "Tóm tắt", 
            "Học vấn",
            "Kỹ năng",
            "Kinh nghiệm",
            "Ngôn ngữ",
            "Project cá nhân và khóa học",
            "Mạng xã hội"
        ],
        "title":"Kỹ sư phần mềm",
        "address": "HCMC",
        "email": "trihieu08101999@gmail.com",
        "phone": "0706987057",
        "note": "Truy cập responsive CV để có trải nghiệm tốt hơn",
        "social": ["Linkedin", "Github (hieunguyen810)"],
        "profile": "Kỹ sư phát triển phần mềm với hai năm kinh nghiệm trong việc phát triển, triển khai, bảo trì và bảo mật ứng dụng web. Có kiến thức nền tảng và mạng và machine learning, kinh nghiệm thực tế trong việc phát triển ứng dụng web backend, hứng thú về bảo mật",
        "education": {
            "degree": "Kỹ sư điện tử viễn thông",
            "studies": "Đại học Bách Khoa Thành phố Hồ Chí Minh",
            "year": "2017-2021"
        },
        "experience": {
            "tma": {
                "title": "Kỹ sư phần mềm",
                "time": "From 2-2021 to 4-2022 | TMA Solutions",
                "detail": [
                    "- Phát triển ứng dụng, cung cấp bản vá lỗi mỗi 2 tháng nhằm cải thiện trải nghiệm người dùng, sửa lỗ hổng bảo mật, nâng cấp 3rd software, ... Xây dựng phiên bản mới cho phần mềm trên, phát triển nhiều tính năng mới. (Nền tảng VoIP)",
                    "- Dựng LDAP client, LDAP server phục vụ việc test, shell script để tự động cài đặt"
                ],
                "tech": "Công nghệ: Java, C++, Spring framework, RHEL, CentOS, Burp Suite, MySQL, LDAP, Tomcat, VoIP, ..."
            },
            "vts":{
                "title": "Kỹ sư phần mềm",
                "time": "From 4-2022 to present | Viettel Solutions",
                "detail": [
                    "- Phối hợp với team hạ tầng, team network, team không gian mạng, team backend, NOC để quản lý servers, kết nối, an toàn thông tin, đảm bảo hiệu năng, tính khả dụng của dịch vụ, ",
                    "- Quản lý, bảo trì, cài đặt, triển khai hệ thống DMS ở môi trường SIT, UAT, POC và Production.",
                    "- Xây dựng DevSecOps pipeline cho môi trường Production",
                    "- Nghiên cứu, thiết kế và triển khai các phương án containerization, giám sát và cải thiện hiệu năng",
                    "- Pentesting cho nhiều hệ thống quan trọng (SAST, DAST và manual test). Chịu trách nhiệm chính về an toàn thông tin cho VTS miền Nam (VPN, Máy tính cá nhân, tiêu chuẩn, quy định, ...)",
                    "- Phát triển backend API sử dụng Spring Boot, MongoDB, gRPC"
                ],
                "tech": "Công nghệ: Java, Spring Boot, Oracle Database, MongoDB, PostgeSQL, gRPC, SocketIO, Burp Suite, Kali Linux, CentOS, Tomcat, ISO security standard, Jenskin, Docker, Ansible, ..."
            }
        },
        "project":[
            "Course: AWS Cloud Practitioner Essentials",
            "PortSwigger vulnerability labs",
            "Luận văn tốt nghiệp: Ứng dụng Machine learning giải điều chế tín hiệu quang bằng ánh sáng khả kiến OLED [2021] [Python, PNN, GRNN, DTNN]",
            "Kanji recognition [2022] [Python, Tkinter, Pyautogui, OpenCV, Sklearn]",
            "Exam Marking - Hand writing recognition [2020] [Python, OpenCV, Tkinter]",
            "Nhận dạng rượu dựa trên quang phổ  ánh sáng bằng deep learning [2019] [Python, Tensorflow]",
            "Responsive resume [2022] [HTML CSS, Javascript]"
        ],
        "language": ["Tiếng Việt", "Tiếng Anh", "Tiếng Nhật"],
        "interest": ["Bóng đá", "Anime", "Nấu ăn", "Đọc sách"]
    },
    "japanese":
    {
        "name":"NGUYEN TRI HIEU",
        "name_vn": "NGUYỄN TRÍ HIẾU",
        "item":[
            "ホーム", 
            "プロフィール", 
            "学歴",
            "特技",
            "職歴", 
            "言語",
            "プロジェクト",
            "ソーシャルメディア"
        ],
        "title":"ソフトウェア工学",
        "address": "HCMC",
        "email": "trihieu08101999@gmail.com",
        "phone": "0706987057",
        "note": "より良い体験のために私のレスポンシブプロファイルにアクセスしてください",
        "social": ["Linkedin", "Github (hieunguyen810)"],
        "profile": "ウェブアプリケーションの開発、配備、保守、および保護に 2 年の経験を持つソフトウェア エンジニア。 ネットワーキングと機械学習の豊富なバックグラウンド、ウェブ アプリケーション バックエンドとシステム エンジニアリングの実務経験、サイバーセキュリティへの関心。",
        "education": {
            "degree": "電子-電気通信の学士号",
            "studies": "ホーチミン市工科大学 (BKU)",
            "year": "2017-2021"
        },
        "experience": {
            "tma": {
                "title": "ソフトウェア工学",
                "time": "2-2021から4-2022まで | TMA Solutions",
                "description": "アプリケーションの開発、保守. ユーザーエクスペリエンスを改善し、ウェブの脆弱性を修正するために、2 か月ごとにパッチをリリースします, ...このアプリケーションの新しいバージョンをリリースし、新しい機能を開発します。",
                "detail": [
                    "- Web アプリケーションの開発と保守。アプリケーションのパッチを 2 か月ごとに提供し、このアプリケーションの新しいバージョンを作成します。(VoIP プラットフォーム)",
                    "- LDAP クライアント, LDAP テストサーバー"
                ],
                "tech": "技術: Java, C++, Spring framework, RHEL, CentOS, Burp Suite, MySQL, LDAP, Tomcat, ..."
            },
            "vts":{
                "title": "ソフトウェア工学",
                "time": "4-2022から現在まで | Viettel Solutions",
                "description": "システム エンジニア、サイバーセキュリティ エンジニア、Java バックエンド デベロッパーとしてのタスクを並列化します。",
                "detail": [
                    "- DMS アプリケーションを管理、維持、インストール、展開します。 Jenkins CICD パイプラインを使用した DevSecOps。 Docker を使用してマイクロサービスをデプロイします。 HAproxy、Nginx、Memcached などでサーバーを最適化する Prometheus、Grafana などでサーバーを監視する",
                    "- 侵入テスト (SAST, DAST, 手動テスト). VTS 南部支店の情報セキュリティの主な責任 (VPN、パーソナル コンピュータ、標準、規制など)",
                    "- Spring Boot, MongoDB, gRPC を使用してバックエンド API を開発する"
                ],
                "tech": "技術: Java, Spring Boot, Oracle Database, MongoDB, Docker, gRPC, SocketIO, Burp Suite, Kali Linux, CentOS, Tomcat, ISO security standard, Docker, Jenkins, Ansible, ..."
            }
        },
        "project":[
            "コース: AWS Cloud Practitioner Essentials",
            "PortSwigger vulnerability labs",
            "卒業論文: Signal demodulation with Machine learning in OLED Visible Light Communication [2021] [Python, PNN, GRNN, DTNN]",
            "漢字認識 [2022] [Python, Tkinter, Pyautogui, OpenCV, Sklearn]",
            "Exam Marking - Hand writing recognition [2020] [Python, OpenCV, Tkinter]",
            "Alcohol recognition based on light spectrum [2019] [Python, Tensorflow]",
            "Responsive resume [2022] [HTML CSS, Javascript]"
        ],
        "language": ["ベトナム語", "英語", "日本語"],
        "interest": ["フットボール", "アニメ", "料理", "読書"]

    }
}