{
    "english":
    {
        "name":"NGUYEN TRI HIEU",
        "name_vn": "NGUYỄN TRÍ HIẾU",
        "item":[
            "Home", 
            "Profile", 
            "Education",
            "Skills",
            "Experience",
            "Languages",
            "Personal Project and Courses",
            "Social"
        ],
        "title":"DevSecOps Engineer",
        "address": "HCMC",
        "email": "trihieu08101999@gmail.com",
        "phone": "0375728325",
        "note": "Visit my responsive profile for a better experience",
        "profile": "Highly motivated DevSecOps Engineer with 4 years of experience in developing, deploying, maintaining, and securing the application. Advanced knowledge in Operation systems and Networking, coupled with in-depth knowledge of backend development and cybersecurity. ",
        "education": {
            "degree": "Bachelor degree of Electronics and Telecommunications",
            "studies": "Hochiminh city university of technology (BKU)",
            "year": "2017-2021"
        },
        "experience": {
            "tma": {
                "title": "Software Engineer",
                "time": "From 2-2021 to 4-2022 | TMA Solutions",
                "detail": [
                    "- Provided outsourced software development services to leading American companies within the telecommunications industry.",
                    "- Managed the software lifecycle for applications, including developing new versions, implementing feature enhancements, and delivering timely security patches.",
                    "- Mastered server and software installation, including scripting automated processes for efficient configuration and deployment."
                ],
                "more_detail": [
                    "- Working with VoIP platform systems, providing call processing functions, reporting, notification,...",
                    "- Develop authentication function via LDAP, install OpenLDAP client, server, write automatically install shell scripts, export ldif file, ...",
                    "- Proactively maintained the security posture by ensure 3rd-party software keeping up-to-date, fix security vulnerabilities such as XSS, local file inclusion, misconfiguration, ...",
                    "- Install test server on VMware Vcloud, Virtual Host Environment.",
                    "- Develop call processing functions with C++, fix web interface errors, performance errors,..."
                ],
                "tech": "Technologies: Java, Bash, Spring framework, RHEL, CentOS, Burp Suite, MySQL, OpenLDAP, Tomcat, VoIP, VMware VCloud, ..."
            },
            "vts":{
                "title": "DevSecOps Engineer",
                "time": "From 4-2022 to 5-2024 | Viettel Solutions", 
                "detail": [
                    "- Led a four-person team to successfully manage server infrastructure, network connectivity, and application security for 24/7 service availability and optimal performance.",
                    "- Fostered a collaborative environment by coordinating effectively with infrastructure, network, cybersecurity, development, and NOC teams.",
                    "- Managed, maintained, and deployed over 20 applications across SIT, UAT, and production environments, ensuring smooth operation and swift incident resolution.",
                    "- Established automated monitoring systems for proactive issue identification and rapid remediation.",
                    "- Owned information security for the VTS Southern branch, encompassing VPN configuration, PC security, and adherence to standards and regulations.",
                    "- Performed comprehensive penetration testing (SAST, DAST, and manual) for web applications, contributing to a robust security posture.",
                    "- Spearheaded the development and implementation of a DevSecOps pipeline utilizing Jenkins, Apache Ant, Ansible, GitLab, Fortify, and SonarQube for accelerated delivery with integrated security."
                ],
                "more_detail":[
                    "- Manage System Engineer team from July 2022 with 4 members",
                    "- Coordinate with the infrastructure team to provide, install servers, configure Load Balancing, DNS on Viettel Cloud infrastructure",
                    "- Provided comprehensive network support to internal teams, assisting with opening connections, configuring reverse proxies and tunnels, verifying network connectivity, firewall rules, and VPN configurations.",
                    "- Ensure cybersecurity best practices for the VTS Southern branch. Check for CVE errors, ISO standards, Vietnamese standards, circulars, and government regulations on cybersecurity. Coordinate with other centers to test many products.",
                    "- Learn and research service conversion from monolithic to microservices with Docker and Kubernetes.",
                    "- Authored comprehensive system administration manuals and documented cross-functional workflows, promoting operational transparency and efficient knowledge sharing."
                ],
                "tech": "Technologies: Java, Spring Boot, Oracle Database, MongoDB, PostgreSQL, gRPC, Burp Suite, Kali Linux, CentOS, Tomcat, ISO security standard, Jenkins, Docker, Ansible, OpenStack, Nginx, Haproxy, Prometheus, Grafana, ..."
            },
            "ocb":{
                "title": "DevOps Engineer",
                "time": "From 6-2024 to present | Orient Commercial Joint Stock Bank", 
                "detail": [
                    "- Managed and maintained the core card firmware. Deployed and configured Kubernetes clusters, implemented robust monitoring systems, streamlined infrastructure provisioning and incident response with ChatOps integration and GitOps pipelines",
                    "- Developed efficient PowerShell scripts to eliminate the need for 100% of manual daily tasks, improving operational efficiency and reducing manual errors.",
                    "- Maintained Way4 Card Issuing platform, collaborated with major payment networks (Mastercard, Visa, JCB, Napas) to enhance system functionality, upgrade infrustructure and ensure PCI-DSS compliances",
                    "- Provided technical assistance to payment accountants,..."
                ],
                "more_detail":[
                    "- ",
                    "- "
                ],
                "tech": "Technologies: Kubernetes, ArgoCD, Oracle DB, Openway Way4, Powershell, Python, Java, Prometheus, Grafana, Loki, Mimir, PCI-DSS, ..."
            }
        },
        "project":[
            "Course: AWS Cloud Operator (SysOps) [2024]",
            "Course: AWS Cloud Practitioner Essentials [2023]",
            "Responsive, multiple languages resume [2022] [HTML, CSS, Javascript]",
            "Graduation thesis: Signal demodulation with Machine learning in OLED Visible Light Communication [1 year research in laboratory - 2021] [Python, PNN, GRNN, DTNN]",
            "Sample serverless api [2024] [AWS localstack, Serverless, NodeJS]",
            "Cheatsheet - How it works [2023]",
            "3D Portfolio [2023] [HTML, CSS, ThreeJS]",
            "Alcohol recognition based on light spectrum [2019] [Python, Tensorflow]",
            "PortSwigger vulnerability labs",
            "Kanji recognition [2022] [Python, Tkinter, Pyautogui, OpenCV, Sklearn]"
        ],
        "language": ["Vietnames", "English", "Japanese"],
        "interest": ["Football", "Anime", "Cooking", "Reading"]
    },
    "vietnamese":
    {
        "name":"NGUYEN TRI HIEU",
        "name_vn": "NGUYỄN TRÍ HIẾU",
        "item":[
            "Home", 
            "Tóm tắt", 
            "Học vấn",
            "Kỹ năng",
            "Kinh nghiệm",
            "Ngôn ngữ",
            "Project cá nhân và khóa học",
            "Mạng xã hội"
        ],
        "title":"DevSecOps Engineer",
        "address": "HCMC",
        "email": "trihieu08101999@gmail.com",
        "phone": "0375728325",
        "note": "Truy cập responsive CV để có trải nghiệm tốt hơn",
        "social": ["Linkedin", "Github (hieunguyen810)"],
        "profile": "Kỹ sư DevSecOps với 4 năm kinh nghiệm trong việc phát triển, triển khai, bảo trì và bảo mật ứng dụng web. Có kiến thức chuyên sâu về Operation và Networking. Kỹ năng trong việc phát triển ứng dụng web backend và an toàn thông tin.",
        "education": {
            "degree": "Kỹ sư điện tử viễn thông",
            "studies": "Đại học Bách Khoa Thành phố Hồ Chí Minh",
            "year": "2017-2021"
        },
        "experience": {
            "tma": {
                "title": "Software Engineer",
                "time": "From 2-2021 to 4-2022 | TMA Solutions",
                "detail": [
                    "- Outsourcing cho công ty của Mỹ, với khách hàng là nhiều công ty viễn thông hàng đầu thế giới",
                    "- Phát triển phiên bản mới và cung cấp bản vá lỗi về giao diện, hiệu năng, bảo mật, ... cho ứng dụng",
                    "- Cài đặt server, phần mềm, viết shell script tự động cài đặt, cấu hình, ..."
                ],
                "more_detail":[
                    "- Làm việc với hệ thống nền tảng VoIP, cung cấp các chứa năng xứ lý cuộc gọi, xuất báo cáo, thông báo, ...",
                    "- Phát triển chức năng xác thực thông qua LDAP, cài đặt OpenLDAP client, server, viết script tự động cài đặt, export ldif file, ...",
                    "- Nâng cấp các phần mềm bên thứ 3, fix các lỗi bảo mật như XSS, local file inclusion, misconfiguration, ...",
                    "- Cài đặt server test trên VMware Vcloud, Virtual Host Environment. ",
                    "- Phát triển các chức năng xứ lý cuộc gọi (C++), fix lỗi giao diện web, lỗi hiệu năng, ..."
                ],
                "tech": "Công nghệ: Java, C++, Spring framework, RHEL, CentOS, Burp Suite, MySQL, OpenLDAP, Tomcat, VoIP, VMware Vcloud, ..."
            },
            "vts":{
                "title": "DevSecOps Engineer",
                "time": "From 4-2022 to present | Viettel Solutions",
                "detail": [
                    "- Dẫn dắt một nhóm với 4 thành viên quản lý hạ tầng, kết nối, an toàn thông tin để đảm bảo ứng dụng hoạt động 24/7 và tối ưu.",
                    "- Phối hợp với team hạ tầng, team network, team không gian mạng, team backend, NOC để quản lý servers, đảm bảo kết nối, an toàn thông tin, hiệu năng.",
                    "- Quản lý, bảo trì, cài đặt, triển khai hơn 20 ứng dụng ở các môi trường SIT, UAT, POC và Production.",
                    "- Nghiên cứu, thiết kế và triển khai các phương án containerization, giám sát và cải thiện hiệu năng",
                    "- Pentesting cho nhiều hệ thống quan trọng (SAST, DAST và manual test). Chịu trách nhiệm chính về an toàn thông tin cho toàn trung tâm với hơn 250 người (VPN, Tài khoản, Tiêu chuẩn, Quy định, ...)",
                    "- Xây dựng DevSecOps pipeline với Jenkins, Gitlab, Ansible, Fortify, Sonarqube, Nexus, ...",
                    "- Viết các tài liệu thiết kế, vận hành, mô tả hệ thống, vẽ cross functional flowchart"
                ],
                "more_detail":[
                    "- Quản lý team System Engineer từ 7-2022 với 4 thành viên",
                    "- Phối hợp team hạ tầng để cung cấp, cài đặt server, cấu hình LB, DNS trên hạ tầng Viettel Cloud",
                    "- Hỗ trợ các team mở kết nối, reverse proxy, tunnel, kiểm tra kết nối mạng, firewall, VPN, ...",
                    "- Chịu trách nhiệm chính về  an toàn thông tin cho trung tâm. Kiểm tra các lỗi CVE, các tiêu chuẩn ISO, tiêu chuẩn Việt Nam, thông tư, quy định của tập chính phủ về an ninh mạng. Phối hợp cùng các trung tâm khác pentest cho nhiều sản phẩm.",
                    "- Tìm hiểu, nghiên cứu chuyển đổi dịch vụ từ monolithic sang microservices.",
                    "- Cài đặt và cấu hình giám sát với Prometheus và Grafana.",
                    "- Xây dựng luồng DevSecOps với các công nghệ như Jenkins, Gitlab, Ansible, Fortify, Sonarqube, Nexus, .... Đã áp dụng cho các hệ việc upcode trên các hệ thống Production."
                ],
                "tech": "Công nghệ: Java, Spring Boot, Oracle Database, MongoDB, PostgreSQL, gRPC, Burp Suite, Kali Linux, CentOS, Tomcat, ISO security standard, Jenkins, Docker, Ansible, OpenStack, Nginx, Haproxy, Prometheus, Grafana, Pfsense, ..."
            },
            "ocb":{
                "title": "DevOps Engineer",
                "time": "From 6-2024 to present | Orient Commercial Joint Stock Bank", 
                "detail": [
                    "- Quản lý và vận hành core card firmware. Triển khai, cấu hình Kubernetes clusters, xây dựng hệ thống giám sát, thiết kế  GitOps pipelines phục vụ triển khai ứng dụng và hạ tầng.",
                    "- Lập trình Powershell scripts cho việc tự động hóa quá trình import, reconcilation payment service files cải thiện vận hành, giảm thiểu lỗi thủ công.", 
                    "- Duy trì hoạt động hệ thống Core thẻ Way4, phối hợp với cái tổ chức thẻ (MasterCard, Visa, JCB, Napas) để cải thiện chức năng hệ thống, nâng cấp hạ tầng và đảm bảo PCI-DSS Compliances", 
                    "- Hỗ trợ kế toán thanh toán truy xuát dữ liệu database"
                ],
                "more_detail":[
                    "- ",
                    "- "
                ],
                "tech": "CÔng nghệ: Kubernetes, ArgoCD, Oracle DB, Openway Way4, Powershell, Python, Prometheus, Grafana, Loki, Mimir, Redis, Kafka, PCI-DSS, ..."
            }
        },
        "project":[
            "Course: AWS Cloud Operator (SysOps) [2024]",
            "Course: AWS Cloud Practitioner Essentials [2023]",
            "Responsive, multiple languages resume [2022] [HTML, CSS, Javascript]",
            "Luận văn tốt nghiệp: Ứng dụng Machine learning giải điều chế tín hiệu quang bằng ánh sáng khả kiến OLED [2021] [Python, PNN, GRNN, DTNN]",
            "Sample serverless api [2024] [AWS localstack, Serverless, NodeJS]",
            "Cheatsheet - How it works [2023]",
            "3D Portfolio [2023] [HTML, CSS, ThreeJS]",
            "Nhận dạng rượu dựa trên quang phổ  ánh sáng bằng deep learning [2019] [Python, Tensorflow]",
            "PortSwigger vulnerability labs",
            "Kanji recognition [2022] [Python, Tkinter, Pyautogui, OpenCV, Sklearn]"
            
        ],
        "language": ["Tiếng Việt", "Tiếng Anh", "Tiếng Nhật"],
        "interest": ["Bóng đá", "Anime", "Nấu ăn", "Đọc sách"]
    },
    "japanese":
    {
        "name":"NGUYEN TRI HIEU",
        "name_vn": "NGUYỄN TRÍ HIẾU",
        "item":[
            "ホーム", 
            "プロフィール", 
            "学歴",
            "特技",
            "職歴", 
            "言語",
            "プロジェクト",
            "ソーシャルメディア"
        ],
        "title":"ソフトウェア工学",
        "address": "HCMC",
        "email": "trihieu08101999@gmail.com",
        "phone": "0375728325",
        "note": "より良い体験のために私のレスポンシブプロファイルにアクセスしてください",
        "social": ["Linkedin", "Github (hieunguyen810)"],
        "profile": "ウェブアプリケーションの開発、配備、保守、および保護に 3.5 年の経験を持つソフトウェア エンジニア。 ネットワーキングと機械学習の豊富なバックグラウンド、ウェブ アプリケーション バックエンドとシステム エンジニアリングの実務経験、サイバーセキュリティへの関心。",
        "education": {
            "degree": "電子-電気通信の学士号",
            "studies": "ホーチミン市工科大学 (BKU)",
            "year": "2017-2021"
        },
        "experience": {
            "tma": {
                "title": "ソフトウェア工学",
                "time": "2-2021から4-2022まで | TMA Solutions",
                "description": "アプリケーションの開発、保守. ユーザーエクスペリエンスを改善し、ウェブの脆弱性を修正するために、2 か月ごとにパッチをリリースします, ...このアプリケーションの新しいバージョンをリリースし、新しい機能を開発します。",
                "detail": [
                    "- 米国企業向けのアウトソーシング。顧客は世界有数の電気通信会社の多くです。",
                    "- 新しいバージョンを開発し、アプリケーションのインターフェイス、パフォーマンス、セキュリティなどに関するパッチを提供します",
                    "- サーバー、ソフトウェアをインストールし、自動的にインストール、構成するためのシェル スクリプトを作成します..."
                ],
                "more_detail":[
                    "- VoIP プラットフォーム システムと連携し、通話処理機能、レポート、通知などを提供します...",
                    "- LDAP 経由の認証機能の開発、OpenLDAP クライアント、サーバーのインストール、自動インストール シェル スクリプトの作成、ldif ファイルのエクスポート、...",
                    "- サードパーティ ソフトウェアをアップグレードし、XSS、ローカル ファイルの組み込み、構成ミスなどのセキュリティ エラーを修正します...",
                    "- VMware Vcloud、仮想ホスト環境にテスト サーバーをインストールします。",
                    "- C++ で呼び出し処理関数を開発し、Web インターフェイス エラー、パフォーマンス エラーなどを修正します..."
                ],
                "tech": "技術: Java, C++, Spring framework, RHEL, CentOS, Burp Suite, MySQL, OpenLDAP, Tomcat, VoIP, VMware Vcloud, ..."
            },
            "vts":{
                "title": "DevSecOps ソフトウェア",
                "time": "4-2022から現在まで | Viettel Solutions",
                "description": "システム エンジニア、サイバーセキュリティ エンジニア、Java バックエンド デベロッパーとしてのタスクを並列化します。",
                "detail": [
                    "- メンバー 4 人の小さなチームを率いる",
                    "- インフラストラクチャ チーム、ネットワーク チーム、サイバーセキュリティ チーム、開発者、NOC と協力してサーバー、接続、セキュリティを管理し、24 時間 365 日のサービス可用性とサービス パフォーマンスを確保します。",
                    "- SIT、UAT、実稼働環境で 20 を超えるアプリケーションを管理、保守、インストール、デプロイします",
                    "- Spring Boot、gRPC、MongoDB を使用してバックエンド API を作成する",
                    "- コンテナ化、パフォーマンス向上、監視のためのソリューションを研究、設計、実装します。",
                    "- さまざまな Web アプリケーション プロジェクトのペネトレーション テスト (SAST、DAST、および手動テスト)。VTS 南部支店の情報セキュリティに対する主な責任 (VPN、パーソナル コンピューター、標準、規制など)",
                    "- Jenkins、Apache Ant、Ansible、Gitlab、Fortify、Sonarqube などを使用して DevSecOps パイプラインを構築することで、デプロイ プロセスを加速します。"
                ],
                "more_detail":[
                    "- 2022 年 7 月から 4 人のメンバーでシステム エンジニア チームを管理します",
                    "- インフラストラクチャ チームと連携して、サーバーの提供、インストール、ロード バランシングの構成、Viettel クラウド インフラストラクチャ上の DNS",
                    "- 接続のオープン、リバース プロキシ、トンネル、ネットワーク接続の確認、ファイアウォール、VPN などのサポート チーム...",
                    "- センターの情報セキュリティを担当します。CVE エラー、ISO 標準、ベトナム標準、回覧、サイバーセキュリティに関する政府規制をチェックします。他のセンターと連携して多くの製品をテストします。",
                    "- Docker と Kubernetes を使用して、モノリシックからマイクロサービスへのサービス変換を学習および研究します。",
                    "- システム管理マニュアルを作成する"
                ],
                "tech": "技術: Java, Spring Boot, Oracle Database, MongoDB, PostgreSQL, gRPC, Burp Suite, Kali Linux, CentOS, Tomcat, ISO security standard, Jenkins, Docker, Ansible, OpenStack, Nginx, Haproxy, Prometheus, Grafana, ..."
            }, 
            "ocb":{
                "title": "DevOps Engineer",
                "time": "From 6-2024 to present | Orient Commercial Joint Stock Bank", 
                "detail": [
                    "- コアカードのファームウェアを管理および保守しました。Kubernetes クラスターを展開および構成し、堅牢な監視システムを実装し、GitOps パイプラインを設計して、アプリケーションとインフラストラクチャのプロビジョニングを効率化しました",
                    "- 効率的な PowerShell スクリプトを開発して、支払いサービス ファイルのインポートと調整を自動化し、運用効率を向上させ、手動エラーを削減しました",
                    "- Way4 コアカードを保守し、主要な支払いネットワーク (Mastercard、Visa、JCB、Napas) と協力して、システム機能を強化し、インフラストラクチャをアップグレードし、PCI-DSS コンプライアンスを確保しました",
                    "- 支払い会計担当者に技術支援を提供し、データベースからのデータ エクスポートを支援し、関連するクエリを解決しました。"
                ],
                "more_detail":[
                    "- ",
                    "- "
                ],
                "tech": "テクノロジー: Kubernetes, ArgoCD, Oracle DB, Openway Way4, Powershell, Python, Java, Prometheus, Grafana, Loki, Mimir, PCI-DSS, .."
            }
        },
        "project":[
            "コース: AWS Cloud Operator (SysOps) [2024]",
            "コース: AWS Cloud Practitioner Essentials [2023]",
            "応答性の高い履歴書 [2022] [HTML CSS, Javascript]",
            "卒業論文: Signal demodulation with Machine learning in OLED Visible Light Communication [2021] [Python, PNN, GRNN, DTNN]",
            "漢字認識 [2022] [Python, Tkinter, Pyautogui, OpenCV, Sklearn]",
            "Cheatsheet - How it works [2023]",
            "3D Portfolio [2023] [HTML, CSS, ThreeJS]",
            "Alcohol recognition based on light spectrum [2019] [Python, Tensorflow]",
            "PortSwigger vulnerability labs"
        ],
        "language": ["ベトナム語", "英語", "日本語"],
        "interest": ["フットボール", "アニメ", "料理", "読書"]

    }
}